## Instructor Demo: Data Cleaning
This program reads in a CSV file, and perfoms a number of data quality checks. Data values that fail the checks are then cleansed.

In [1]:
# Initial imports
import pandas as pd
from pathlib import Path

### Read in CSV and take a sample

In [30]:
# Take sample of data
data = Path(r'C:\Users\TribThapa\Desktop\Thapa\ResearchFellow\Courses\FinTech_Bootcamp_MonashUni2021\monu-mel-virt-fin-pt-05-2021-u-c\Activities\Week 3\2\04-Ins_Data_Cleaning\Resources\order_data.csv')

data_df = pd.read_csv(data)
data_df.head()

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
4   413853121    CM458565         NaN   4/24/2019

### Identify DataFrame Data Types

In [6]:
# Retrieve DataFrame data types
data_df.dtypes

order_no        int64
customer_no    object
order_total    object
order_date     object
dtype: object

### Assess data quality by identifying the number of rows

In [8]:
# Identify Series count
data_df.count()

order_no       8
customer_no    7
order_total    7
order_date     8
dtype: int64

### Assess data quality by identifying the number of times a value occurs

In [9]:
# Identify frequency of values
data_df['order_no'].value_counts()

4465241327    2
452519232     1
45235825      1
45251825      1
452517125     1
2356363       1
413853121     1
Name: order_no, dtype: int64

### Assess data quality by checking for nulls

In [11]:
# Check for null values
data_df.isnull()

   order_no  customer_no  order_total  order_date
0     False        False        False       False
1     False        False        False       False
2     False        False        False       False
3     False        False        False       False
4     False        False         True       False
5     False        False        False       False
6     False        False        False       False
7     False         True        False       False

In [12]:
(1/7)*100

14.285714285714285

### Assess data quality by determining the percentage of nulls

In [7]:
# Determine percentage of nulls
data_df.isnull().mean() * 100

customer_no    12.5
order_total    12.5
order_date      0.0
dtype: float64

### Assess data quality by determining the number of nulls

In [13]:
# Determine number of nulls
data_df.isnull().sum()

order_no       0
customer_no    1
order_total    1
order_date     0
dtype: int64

### Cleanse data by filling nulls with default value (i.e. "Unknown", 0, or mean() is common)

In [16]:
# Cleanse nulls from DataFrame by filling na
data_df['customer_no'] = data_df['customer_no'].fillna('Unknown')
data_df['order_total'] = data_df['order_total'].fillna('Unknown')

data_df

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
4   413853121    CM458565     Unknown   4/24/2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

### Cleanse data by dropping nulls

In [18]:
# Cleaning nulls from DataFrame by dropping
data_df = data_df.dropna().copy()
data_df

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
3  4465241327     AK45765    $1103.36  04-25-2019
4   413853121    CM458565     Unknown   4/24/2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

### Checking number of nulls again

In [21]:
data_df.isnull().sum()

order_no       0
customer_no    0
order_total    0
order_date     0
dtype: int64

### Assess data quality by checking for duplicate rows

In [22]:
data_df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
dtype: bool

### Assess data quality by checking for duplicate customer_no values

In [23]:
# Check duplicates for specific field
data_df['order_no'].duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
Name: order_no, dtype: bool

### Cleanse data by dropping duplicates

In [25]:
# Clean duplicates
data_df = data_df.drop_duplicates().copy()
data_df

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
4   413853121    CM458565     Unknown   4/24/2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232     Unknown     $141.25  01-10-2019

### Assess data quality by using `head` function to sample data and identify currency symbols

In [26]:
# Identify if numeric field with $ symbol
data_df.head()

     order_no customer_no order_total  order_date
0   452517125    CM458565     $141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765    $1103.36  04-25-2019
4   413853121    CM458565     Unknown   4/24/2019
5    45235825      TV4663       65.42  04-29-2019

### Cleanse data by replacing currency symbols

In [32]:
# Clean identified numeric fields with $ symbol
data_df['order_total'] = data_df['order_total'].str.replace("$", "")
data_df

C:\Users\TribThapa\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.

     order_no customer_no order_total  order_date
0   452517125    CM458565      141.25  01-10-2019
1    45251825    CJ458565       14.00  04/25/2019
2  4465241327     AK45765     1103.36  04-25-2019
3  4465241327     AK45765     1103.36  04-25-2019
4   413853121    CM458565         NaN   4/24/2019
5    45235825      TV4663       65.42  04-29-2019
6     2356363        2124   258936.12  04-29-2019
7   452519232         NaN      141.25  01-10-2019

In [28]:
# Retrieve data types to confirm what needs to be converted
data_df.dtypes

order_no        int64
customer_no    object
order_total    object
order_date     object
dtype: object

In [34]:
# Convert `order_total` from `object` to `float`
data_df['order_total'] = data_df['order_total'].astype('float')
data_df

     order_no customer_no  order_total  order_date
0   452517125    CM458565       141.25  01-10-2019
1    45251825    CJ458565        14.00  04/25/2019
2  4465241327     AK45765      1103.36  04-25-2019
3  4465241327     AK45765      1103.36  04-25-2019
4   413853121    CM458565          NaN   4/24/2019
5    45235825      TV4663        65.42  04-29-2019
6     2356363        2124    258936.12  04-29-2019
7   452519232         NaN       141.25  01-10-2019

In [36]:
# Confirm conversion worked as expected
data_df.dtypes

order_no         int64
customer_no     object
order_total    float64
order_date      object
dtype: object